In [1]:
import pandas as pd
import sqlite3

In [2]:
# Conectamos con la base de datos chinook.db
connection = sqlite3.connect("data/sql-murder-mystery.db")

# Obtenemos un cursor que utilizaremos para hacer las queries
crsr = connection.cursor()

In [3]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):

    # Ejecuta la query
    crsr.execute(query)

    # Almacena los datos de la query 
    ans = crsr.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in crsr.description]

    return pd.DataFrame(ans,columns=names)

In [23]:
pd.set_option('display.max_colwidth', 780)

sql_query("SELECT * FROM crime_scene_report WHERE city = 'SQL City' AND date = '20180115' AND type = 'murder'")

       date  ...      city
0  20180115  ...  SQL City

[1 rows x 4 columns]

In [17]:
sql_query("SELECT * FROM person WHERE address_street_name = 'Franklin Ave' AND name LIKE 'Annabel%'")

      id            name  ...  address_street_name        ssn
0  16371  Annabel Miller  ...         Franklin Ave  318771143

[1 rows x 6 columns]

In [20]:
sql_query("SELECT * FROM person WHERE address_street_name = 'Northwestern Dr' ORDER BY address_number DESC LIMIT 1")

      id            name  ...  address_street_name        ssn
0  14887  Morty Schapiro  ...      Northwestern Dr  111564949

[1 rows x 6 columns]

In [24]:
sql_query("SELECT * FROM interview WHERE person_id = 14887 OR person_id = 16371")

   person_id                                                                                                                                                                                                                       transcript
0      14887  I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W".
1      16371                                                                                                            I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.

Oí un disparo y vi salir corriendo a un hombre. Llevaba una bolsa de "Get Fit Now Gym". El número de socio de la bolsa empezaba por "48Z". Sólo los miembros de oro tienen esas bolsas. El hombre entró en un coche con una matrícula que incluía "H42W".

Vi el asesinato y reconocí al asesino en mi gimnasio cuando estaba haciendo ejercicio la semana pasada, el 9 de enero.

In [26]:
sql_query("SELECT * FROM drivers_license WHERE plate_number LIKE '%H42W%' AND gender = 'male'")

       id  age  height eye_color  ... gender plate_number   car_make car_model
0  423327   30      70     brown  ...   male       0H42W2  Chevrolet  Spark LS
1  664760   21      71     black  ...   male       4H42WR     Nissan    Altima

[2 rows x 9 columns]

In [33]:
sql_query("SELECT * FROM get_fit_now_member WHERE membership_status = 'gold' AND membership_start_date < 20180109 AND id LIKE '48Z%'")

      id  person_id           name  membership_start_date membership_status
0  48Z7A      28819   Joe Germuska               20160305              gold
1  48Z55      67318  Jeremy Bowers               20160101              gold

In [34]:
sql_query("SELECT * FROM person WHERE license_id = 423327 OR license_id = 664760")

      id            name  ...    address_street_name        ssn
0  51739  Tushar Chandra  ...                 Phi St  137882671
1  67318   Jeremy Bowers  ...  Washington Pl, Apt 3A  871539279

[2 rows x 6 columns]

In [37]:
sql_query("SELECT p.* FROM person as p join get_fit_now_member as g on p.id = g.person_id join drivers_license as d on p.license_id = d.id WHERE p.license_id = 423327 OR p.license_id = 664760 AND g.membership_status = 'gold' AND g.membership_start_date < 20180109 AND g.id LIKE '48Z%'")

      id           name  ...    address_street_name        ssn
0  67318  Jeremy Bowers  ...  Washington Pl, Apt 3A  871539279

[1 rows x 6 columns]

In [38]:
sql_query("SELECT * FROM interview WHERE person_id = 67318")

   person_id                                                                                                                                                                                                                                          transcript
0      67318  I was hired by a woman with a lot of money. I don't know her name but I know she's around 5'5" (65") or 5'7" (67"). She has red hair and she drives a Tesla Model S. I know that she attended the SQL Symphony Concert 3 times in December 2017.\n

In [42]:
sql_query("SELECT * FROM drivers_license WHERE car_make = 'Tesla' AND car_model = 'Model S' AND gender = 'female' AND hair_color = 'red'")

       id  age  height eye_color  ...  gender plate_number car_make car_model
0  202298   68      66     green  ...  female       500123    Tesla   Model S
1  291182   65      66      blue  ...  female       08CM64    Tesla   Model S
2  918773   48      65     black  ...  female       917UU3    Tesla   Model S

[3 rows x 9 columns]

In [45]:
sql_query("SELECT * FROM person WHERE license_id = 202298 OR license_id = 291182 OR license_id = 918773")

      id              name  ...  address_street_name        ssn
0  78881          Red Korb  ...          Camerata Dr  961388910
1  90700     Regina George  ...            Maple Ave  337169072
2  99716  Miranda Priestly  ...           Golden Ave  987756388

[3 rows x 6 columns]

In [46]:
sql_query("SELECT * FROM facebook_event_checkin where person_id = 78881 OR person_id = 90700 OR person_id = 99716")

   person_id  event_id            event_name      date
0      99716      1143  SQL Symphony Concert  20171206
1      99716      1143  SQL Symphony Concert  20171212
2      99716      1143  SQL Symphony Concert  20171229